app/controllers/foods_controller.rb

SELECT "foods".* FROM "foods"
---
  def index
    @foods = Food.all

INSERT INTO "foods" ("name", "description", "price", "section", "img_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @food = Food.new(food_params)

    respond_to do |format|
      if @food.save

UPDATE "foods" SET "img_url" = $1, "updated_at" = $2 WHERE "foods"."id" = $3  [["img_url", "http://loremflickr.com/320/240/canhchua"], ["updated_at", "2016-03-12 17:11:21.879319"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @food.update(food_params)

SELECT  "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT 1  [["id", 2]]
---
    def set_food
      @food = Food.find(params[:id])