app/controllers/orders_controller.rb

SELECT "orders".* FROM "orders"
---
  def index
    @orders = Order.all

SELECT  "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT 1  [["id", 1]]
---
  def new
    # @order = Order.new
    @food = Food.find params[:food_id]

SELECT  "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "orders" ("name", "phone", "address", "food_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "a"], ["phone", "a"], ["address", "a"], ["food_id", 1], ["created_at", "2016-03-14 11:46:51.337775"], ["updated_at", "2016-03-14 11:46:51.337775"]]
---
  def create
    @food = Food.find params[:food_id]

    @order = Order.new(order_params)
    @order.food = @food
    # respond_to do |format|
      if @order.save